In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [2]:
df = pd.read_csv('dataset_combined.csv')

In [3]:
df.head()
df2 = df

In [4]:
df = df.drop(columns="Name")

In [5]:
df

,Education Qualification,Gender,Community,Religion,Exservice-men,Disability,Sports,Annual-Percentage,Income,India,Outcome
0,Undergraduate,Male,General,Hindu,Yes,Yes,Yes,90-100,Upto 1.5L,In,1
1,Undergraduate,Male,General,Hindu,Yes,Yes,No,90-100,Upto 1.5L,In,1
2,Undergraduate,Male,General,Muslim,Yes,Yes,Yes,90-100,Upto 1.5L,In,1
3,Undergraduate,Male,General,Muslim,Yes,Yes,No,90-100,Upto 1.5L,In,1
4,Undergraduate,Male,General,Chirstian,Yes,Yes,Yes,90-100,Upto 1.5L,In,1
...,...,...,...,...,...,...,...,...,...,...,...
245755,Doctrate,Female,Minority,Muslim,No,No,No,60-70,Above 6L,Out,1
245756,Doctrate,Female,Minority,Chirstian,No,No,Yes,60-70,Above 6L,Out,1
245757,Doctrate,Female,Minority,Chirstian,No,No,No,60-70,Above 6L,Out,1
245758,Doctrate,Female,Minority,Others,No,No,Yes,60-70,Above 6L,Out,1
245759,Doctrate,Female,Minority,Others,No,No,No,60-70,Above 6L,Out,1

In [6]:
dict = {"Undergraduate":1,
"Postgraduate":2,
"Doctrate":3 }
df['Education Qualification'] = df['Education Qualification'].map(dict)

In [7]:
dict = {"General":1,
"OBC":2,
"ST/SC":3,
"Minority":4}
df['Community'] = df['Community'].map(dict)

In [8]:
dict = {"Hindu":1,
"Muslim":2,
"Chirstian":3,
"Others":4}
df['Religion'] = df['Religion'].map(dict)

In [9]:
dict = {"90-100":1,
"80-90":2,
"70-80":3,
"60-70":4}
df['Annual-Percentage'] = df['Annual-Percentage'].map(dict)

In [10]:
dict = {"Upto 1.5L":1,
"1.5L to 3L":2,
"3L to 6L":3, 
"Above 6L":4}
df['Income'] = df['Income'].map(dict)

In [11]:
dict = {"Male":1,
"Female":2}
df['Gender'] = df['Gender'].map(dict)

In [12]:
dict = {"Yes":1,
"No":2}
df['Exservice-men'] = df['Exservice-men'].map(dict)

In [13]:
dict = {"Yes":1,
"No":2}
df['Disability'] = df['Disability'].map(dict)

In [14]:
dict = {"Yes":1,
"No":2}
df['Sports'] = df['Sports'].map(dict)

In [15]:
dict = {"In":1,
"Out":2}
df['India'] = df['India'].map(dict)

In [16]:
df.shape

(245760, 11)

In [17]:
df

,Education Qualification,Gender,Community,Religion,Exservice-men,Disability,Sports,Annual-Percentage,Income,India,Outcome
0,1,1,1.0,1,1,1,1,1,1,1,1
1,1,1,1.0,1,1,1,2,1,1,1,1
2,1,1,1.0,2,1,1,1,1,1,1,1
3,1,1,1.0,2,1,1,2,1,1,1,1
4,1,1,1.0,3,1,1,1,1,1,1,1
...,...,...,...,...,...,...,...,...,...,...,...
245755,3,2,4.0,2,2,2,2,4,4,2,1
245756,3,2,4.0,3,2,2,1,4,4,2,1
245757,3,2,4.0,3,2,2,2,4,4,2,1
245758,3,2,4.0,4,2,2,1,4,4,2,1
245759,3,2,4.0,4,2,2,2,4,4,2,1

In [18]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 245760 entries, 0 to 245759
Data columns (total 11 columns):
 #   Column                   Non-Null Count   Dtype
---  ------                   --------------   -----
 0   Education Qualification  245760 non-null  int64
 1   Gender                   245760 non-null  int64
 2   Community                184320 non-null  float64
 3   Religion                 245760 non-null  int64
 4   Exservice-men            245760 non-null  int64
 5   Disability               245760 non-null  int64
 6   Sports                   245760 non-null  int64
 7   Annual-Percentage        245760 non-null  int64
 8   Income                   245760 non-null  int64
 9   India                    245760 non-null  int64
 10  Outcome                  245760 non-null  int64
dtypes: float64(1), int64(10)
memory usage: 20.6 MB

In [19]:
df.dropna(inplace=True)

In [20]:
df['Education Qualification'] = df['Education Qualification'].astype('int32')
df['Community'] = df['Community'].astype('float32')
df['Religion'] = df['Religion'].astype('int32')
df['Annual-Percentage'] = df['Annual-Percentage'].astype('int32')
df['Income'] = df['Income'].astype('int32')
df['Gender'] = df['Gender'].astype('int32')
df['Exservice-men'] = df['Exservice-men'].astype('int32')
df['Disability'] = df['Disability'].astype('int32')
df['Sports'] = df['Sports'].astype('int32')
df['India'] = df['India'].astype('int32')
df['Outcome'] = df['Outcome'].astype('int32')

In [21]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 184320 entries, 0 to 245759
Data columns (total 11 columns):
 #   Column                   Non-Null Count   Dtype
---  ------                   --------------   -----
 0   Education Qualification  184320 non-null  int32
 1   Gender                   184320 non-null  int32
 2   Community                184320 non-null  float32
 3   Religion                 184320 non-null  int32
 4   Exservice-men            184320 non-null  int32
 5   Disability               184320 non-null  int32
 6   Sports                   184320 non-null  int32
 7   Annual-Percentage        184320 non-null  int32
 8   Income                   184320 non-null  int32
 9   India                    184320 non-null  int32
 10  Outcome                  184320 non-null  int32
dtypes: float32(1), int32(10)
memory usage: 9.1 MB

In [22]:
x = df.drop('Outcome',axis=1)
y = df[['Outcome']]

In [23]:
from sklearn.model_selection import train_test_split

x_train,x_test,y_train,y_test = train_test_split(x,y,test_size=0.15)

In [24]:
from sklearn.ensemble import RandomForestClassifier

rdf = RandomForestClassifier()

rdf.fit(x_train,y_train)

print(rdf.score(x_train,y_train)*100)
print(rdf.score(x_test,y_test)*100)

c:\Python312\Lib\site-packages\sklearn\base.py:1473: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples,), for example using ravel().
  return fit_method(estimator, *args, **kwargs)

87.90977328431373
86.1328125

In [25]:
pred = rdf.predict(x_test)
y_test['prediction']=pred

In [35]:
import joblib
joblib.dump(df2,"df2.lb")
joblib.dump(rdf,'rdf.lb')

['rdf.lb']

In [27]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 184320 entries, 0 to 245759
Data columns (total 11 columns):
 #   Column                   Non-Null Count   Dtype
---  ------                   --------------   -----
 0   Education Qualification  184320 non-null  int32
 1   Gender                   184320 non-null  int32
 2   Community                184320 non-null  float32
 3   Religion                 184320 non-null  int32
 4   Exservice-men            184320 non-null  int32
 5   Disability               184320 non-null  int32
 6   Sports                   184320 non-null  int32
 7   Annual-Percentage        184320 non-null  int32
 8   Income                   184320 non-null  int32
 9   India                    184320 non-null  int32
 10  Outcome                  184320 non-null  int32
dtypes: float32(1), int32(10)
memory usage: 9.1 MB

In [36]:
x_test.columns

Index(['Education Qualification', 'Gender', 'Community', 'Religion',
       'Exservice-men', 'Disability', 'Sports', 'Annual-Percentage', 'Income',
       'India'],
      dtype='object')

In [28]:
df.isnull().sum()

Education Qualification    0
Gender                     0
Community                  0
Religion                   0
Exservice-men              0
Disability                 0
Sports                     0
Annual-Percentage          0
Income                     0
India                      0
Outcome                    0
dtype: int64

In [29]:
df.dropna(inplace=True)

In [30]:
x_train.head()

,Education Qualification,Gender,Community,Religion,Exservice-men,Disability,Sports,Annual-Percentage,Income,India
164516,2,1,4.0,3,1,1,1,3,3,1
210856,1,1,2.0,1,2,1,1,3,3,2
159709,3,2,4.0,3,2,2,2,2,2,2
97048,3,1,4.0,1,1,1,1,4,2,2
86510,1,2,1.0,4,2,1,1,3,3,2

In [31]:
x_train.columns

Index(['Education Qualification', 'Gender', 'Community', 'Religion',
       'Exservice-men', 'Disability', 'Sports', 'Annual-Percentage', 'Income',
       'India'],
      dtype='object')

In [32]:
y_train.head()

        Outcome
164516        0
210856        0
159709        0
97048         0
86510         0

In [33]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 245760 entries, 0 to 245759
Data columns (total 12 columns):
 #   Column                   Non-Null Count   Dtype
---  ------                   --------------   -----
 0   Name                     245760 non-null  object
 1   Education Qualification  245760 non-null  object
 2   Gender                   245760 non-null  object
 3   Community                245760 non-null  object
 4   Religion                 245760 non-null  object
 5   Exservice-men            245760 non-null  object
 6   Disability               245760 non-null  object
 7   Sports                   245760 non-null  object
 8   Annual-Percentage        245760 non-null  object
 9   Income                   245760 non-null  object
 10  India                    245760 non-null  object
 11  Outcome                  245760 non-null  int64
dtypes: int64(1), object(11)
memory usage: 22.5+ MB

In [34]:
df2.columns

Index(['Name', 'Education Qualification', 'Gender', 'Community', 'Religion',
       'Exservice-men', 'Disability', 'Sports', 'Annual-Percentage', 'Income',
       'India', 'Outcome'],
      dtype='object')